var str = {
    "jsondata":
    [{
        "x":"100",
        "y":"40",
        "title":"1",
        "text":"地图压力测试",
        "type": "单飞"
    }
    
    ,{
        "x":"120",
        "y":"40",
        "title":"2",
        "text":"地图压力测试",
        "type": "舞厅"
    }
    
    ,{
        "x":"100",
        "y":"30",
        "title":"3",
        "text":"地图压力测试",
        "type": "单飞"
    }
    ,{
        "x":"120",
        "y":"30",
        "title":"4",
        "text":"地图压力测试",
        "type": "洗浴"
    }
    
    ,{
        "x":"120",
        "y":"31",
        "title":"5",
        "text":"地图压力测试",
        "type": "单飞"
    }
    
    ,{
        "x":"119",
        "y":"40",
        "title":"6",
        "text":"地图压力测试",
        "type": "经纪"
    }
    ,{
        "x":"118",
        "y":"40",
        "title":"7",
        "text":"地图压力测试",
        "type": "单飞"
    }
    ,{
        "x":"117",
        "y":"40",
        "title":"8",
        "text":"地图压力测试",
        "type": "小巷"
    }
    ,{
        "x":"116",
        "y":"40",
        "title":"9",
        "text":"地图压力测试",
        "type": "足疗"
    }
    ,{
        "x":"115",
        "y":"40",
        "title":"10",
        "text":"地图压力测试",
        "type": "type2"
    }
    ,{
        "x":"114",
        "y":"40",
        "title":"11",
        "text":"地图压力测试",
        "type": "type2"
    }
    ,{
        "x":"113",
        "y":"40",
        "title":"12",
        "text":"地图压力测试",
        "type": "单飞"
    }
    ,{
        "x":"112",
        "y":"40",
        "title":"13",
        "text":"地图压力测试",
        "type": "洗浴"
    }
    ,{
        "x":"111",
        "y":"40",
        "title":"14",
        "text":"地图压力测试",
        "type": "舞厅"
    }
    ,{
        "x":"110",
        "y":"40",
        "title":"15",
        "text":"地图压力测试",
        "type": "小巷"
    }
    ,{
        "x":"109",
        "y":"40",
        "title":"16",
        "text":"地图压力测试",
        "type": "小巷"
    }
    ,{
        "x":"108",
        "y":"40",
        "title":"17",
        "text":"地图压力测试",
        "type": "经纪"
    }
    ,{
        "x":"107",
        "y":"40",
        "title":"18",
        "text":"地图压力测试",
        "type": "洗浴"
    }
    ,{
        "x":"106",
        "y":"40",
        "title":"19",
        "text":"地图压力测试",
        "type": "单飞"
    }
    ,{
        "x":"105",
        "y":"40",
        "title":"20",
        "text":"地图压力测试",
        "type": "小巷"
    }
    ,{
        "x":"104",
        "y":"40",
        "title":"21",
        "text":"地图压力测试",
        "type": "按摩"
    }
    ,{
        "x":"103",
        "y":"40",
        "title":"22",
        "text":"地图压力测试",
        "type": "单飞"
    }
    ,{
        "x":"102",
        "y":"40",
        "title":"23",
        "text":"地图压力测试",
        "type": "单飞"
    }
    ,{
        "x":"101",
        "y":"40",
        "title":"24",
        "text":"地图压力测试",
        "type": "单飞"
    }
    
    ,{
        "x":"119",
        "y":"38",
        "title":"25",
        "text":"地图压力测试",
        "type": "type2"
    }
    ,{
        "x":"118",
        "y":"38",
        "title":"26",
        "text":"地图压力测试",
        "type": "小巷"
    }
    ,{
        "x":"117",
        "y":"38",
        "title":"27",
        "text":"地图压力测试",
        "type": "足疗"
    }
    ,{
        "x":"116",
        "y":"38",
        "title":"28",
        "text":"地图压力测试",
        "type": "按摩"
    }
    ,{
        "x":"115",
        "y":"38",
        "title":"29",
        "text":"地图压力测试",
        "type": "单飞"
    }
    ,{
        "x":"114",
        "y":"38",
        "title":"30",
        "text":"地图压力测试",
        "type": "小巷"
    }
    ,{
        "x":"113",
        "y":"38",
        "title":"31",
        "text":"地图压力测试",
        "type": "经纪"
    }
    ,{
        "x":"112",
        "y":"38",
        "title":"32",
        "text":"地图压力测试",
        "type": "舞厅"
    }
    ,{
        "x":"111",
        "y":"38",
        "title":"33",
        "text":"地图压力测试",
        "type": "洗浴"
    }
    ,{
        "x":"110",
        "y":"38",
        "title":"34",
        "text":"地图压力测试",
        "type": "足疗"
    }
    ,{
        "x":"109",
        "y":"38",
        "title":"35",
        "text":"地图压力测试",
        "type": "按摩"
    }
    ,{
        "x":"108",
        "y":"38",
        "title":"36",
        "text":"地图压力测试",
        "type": "洗浴"
    }
    ,{
        "x":"107",
        "y":"38",
        "title":"37",
        "text":"地图压力测试",
        "type": "足疗"
    }
    ,{
        "x":"106",
        "y":"38",
        "title":"38",
        "text":"地图压力测试",
        "type": "小巷"
    }
    ,{
        "x":"105",
        "y":"38",
        "title":"39",
        "text":"地图压力测试",
        "type": "单飞"
    }
    ,{
        "x":"104",
        "y":"38",
        "title":"40",
        "text":"地图压力测试",
        "type": "经纪"
    }
    ,{
        "x":"103",
        "y":"38",
        "title":"41",
        "text":"地图压力测试",
        "type": "小巷"
    }
    ,{
        "x":"102",
        "y":"38",
        "title":"42",
        "text":"地图压力测试",
        "type": "单飞"
    }
    ,{
        "x":"101",
        "y":"38",
        "title":"43",
        "text":"地图压力测试",
        "type": "小巷"
    }
    
    
    ,{
        "x":"119",
        "y":"36",
        "title":"44",
        "text":"地图压力测试",
        "type": "单飞"
    }
    ,{
        "x":"118",
        "y":"36",
        "title":"45",
        "text":"地图压力测试",
        "type": "按摩"
    }
    ,{
        "x":"117",
        "y":"36",
        "title":"46",
        "text":"地图压力测试",
        "type": "小巷"
    }
    ,{
        "x":"116",
        "y":"36",
        "title":"47",
        "text":"地图压力测试",
        "type": "小巷"
    }
    ,{
        "x":"115",
        "y":"36",
        "title":"48",
        "text":"地图压力测试",
        "type": "单飞"
    }
    ,{
        "x":"114",
        "y":"36",
        "title":"49",
        "text":"地图压力测试",
        "type": "经纪"
    }
    ,{
        "x":"113",
        "y":"36",
        "title":"50",
        "text":"地图压力测试",
        "type": "单飞"
    }
    ,{
        "x":"112",
        "y":"36",
        "title":"51",
        "text":"地图压力测试",
        "type": "小巷"
    }
    ,{
        "x":"111",
        "y":"36",
        "title":"52",
        "text":"地图压力测试",
        "type": "舞厅"
    }
    ,{
        "x":"110",
        "y":"36",
        "title":"53",
        "text":"地图压力测试",
        "type": "小巷"
    }
    ,{
        "x":"109",
        "y":"36",
        "title":"54",
        "text":"地图压力测试",
        "type": "经纪"
    }
    ,{
        "x":"108",
        "y":"36",
        "title":"55",
        "text":"地图压力测试",
        "type": "小巷"
    }
    ,{
        "x":"107",
        "y":"36",
        "title":"56",
        "text":"地图压力测试",
        "type": "洗浴"
    }
    ,{
        "x":"106",
        "y":"36",
        "title":"57",
        "text":"地图压力测试",
        "type": "单飞"
    }
    ,{
        "x":"105",
        "y":"36",
        "title":"58",
        "text":"地图压力测试",
        "type": "按摩"
    }
    ,{
        "x":"104",
        "y":"36",
        "title":"59",
        "text":"地图压力测试",
        "type": "洗浴"
    }
    ,{
        "x":"103",
        "y":"36",
        "title":"60",
        "text":"地图压力测试",
        "type": "小巷"
    }
    ,{
        "x":"102",
        "y":"36",
        "title":"61",
        "text":"地图压力测试",
        "type": "单飞"
    }
    ,{
        "x":"101",
        "y":"36",
        "title":"62",
        "text":"地图压力测试",
        "type": "小巷"
    }
    
    ,{
        "x":"119",
        "y":"34",
        "title":"63",
        "text":"地图压力测试",
        "type": "单飞"
    }
    ,{
        "x":"118",
        "y":"34",
        "title":"64",
        "text":"地图压力测试",
        "type": "按摩"
    }
    ,{
        "x":"117",
        "y":"34",
        "title":"65",
        "text":"地图压力测试",
        "type": "小巷"
    }
    ,{
        "x":"116",
        "y":"34",
        "title":"66",
        "text":"地图压力测试",
        "type": "小巷"
    }
    ,{
        "x":"115",
        "y":"34",
        "title":"67",
        "text":"地图压力测试",
        "type": "单飞"
    }
    ,{
        "x":"114",
        "y":"34",
        "title":"68",
        "text":"地图压力测试",
        "type": "经纪"
    }
    ,{
        "x":"113",
        "y":"34",
        "title":"69",
        "text":"地图压力测试",
        "type": "单飞"
    }
    ,{
        "x":"112",
        "y":"34",
        "title":"70",
        "text":"地图压力测试",
        "type": "小巷"
    }
    ,{
        "x":"111",
        "y":"34",
        "title":"71",
        "text":"地图压力测试",
        "type": "舞厅"
    }
    ,{
        "x":"110",
        "y":"34",
        "title":"72",
        "text":"地图压力测试",
        "type": "小巷"
    }
    ,{
        "x":"109",
        "y":"34",
        "title":"73",
        "text":"地图压力测试",
        "type": "经纪"
    }
    ,{
        "x":"108",
        "y":"34",
        "title":"74",
        "text":"地图压力测试",
        "type": "小巷"
    }
    ,{
        "x":"107",
        "y":"34",
        "title":"75",
        "text":"地图压力测试",
        "type": "洗浴"
    }
    ,{
        "x":"106",
        "y":"34",
        "title":"76",
        "text":"地图压力测试",
        "type": "单飞"
    }
    ,{
        "x":"105",
        "y":"34",
        "title":"77",
        "text":"地图压力测试",
        "type": "按摩"
    }
    ,{
        "x":"104",
        "y":"34",
        "title":"78",
        "text":"地图压力测试",
        "type": "洗浴"
    }
    ,{
        "x":"103",
        "y":"34",
        "title":"79",
        "text":"地图压力测试",
        "type": "小巷"
    }
    ,{
        "x":"102",
        "y":"34",
        "title":"80",
        "text":"地图压力测试",
        "type": "单飞"
    }
    ,{
        "x":"101",
        "y":"34",
        "title":"81",
        "text":"地图压力测试",
        "type": "小巷"
    }
    
    ,{
        "x":"119",
        "y":"32",
        "title":"82",
        "text":"地图压力测试",
        "type": "单飞"
    }
    ,{
        "x":"118",
        "y":"32",
        "title":"83",
        "text":"地图压力测试",
        "type": "按摩"
    }
    ,{
        "x":"117",
        "y":"32",
        "title":"84",
        "text":"地图压力测试",
        "type": "小巷"
    }
    ,{
        "x":"116",
        "y":"32",
        "title":"85",
        "text":"地图压力测试",
        "type": "小巷"
    }
    ,{
        "x":"115",
        "y":"32",
        "title":"86",
        "text":"地图压力测试",
        "type": "单飞"
    }
    ,{
        "x":"114",
        "y":"32",
        "title":"87",
        "text":"地图压力测试",
        "type": "经纪"
    }
    ,{
        "x":"113",
        "y":"32",
        "title":"88",
        "text":"地图压力测试",
        "type": "单飞"
    }
    ,{
        "x":"112",
        "y":"32",
        "title":"89",
        "text":"地图压力测试",
        "type": "小巷"
    }
    ,{
        "x":"111",
        "y":"32",
        "title":"90",
        "text":"地图压力测试",
        "type": "舞厅"
    }
    ,{
        "x":"110",
        "y":"32",
        "title":"91",
        "text":"地图压力测试",
        "type": "小巷"
    }
    ,{
        "x":"109",
        "y":"32",
        "title":"92",
        "text":"地图压力测试",
        "type": "经纪"
    }
    ,{
        "x":"108",
        "y":"32",
        "title":"93",
        "text":"地图压力测试",
        "type": "小巷"
    }
    ,{
        "x":"107",
        "y":"32",
        "title":"94",
        "text":"地图压力测试",
        "type": "洗浴"
    }
    ,{
        "x":"106",
        "y":"32",
        "title":"95",
        "text":"地图压力测试",
        "type": "单飞"
    }
    ,{
        "x":"105",
        "y":"32",
        "title":"96",
        "text":"地图压力测试",
        "type": "按摩"
    }
    ,{
        "x":"104",
        "y":"32",
        "title":"97",
        "text":"地图压力测试",
        "type": "洗浴"
    }
    ,{
        "x":"103",
        "y":"32",
        "title":"98",
        "text":"地图压力测试",
        "type": "小巷"
    }
    ,{
        "x":"102",
        "y":"32",
        "title":"99",
        "text":"地图压力测试",
        "type": "单飞"
    }
    ,{
        "x":"101",
        "y":"32",
        "title":"100",
        "text":"地图压力测试",
        "type": "小巷"
    }
        ,{
        "x":"101",
        "y":"30",
        "title":"101",
        "text":"地图压力测试",
        "type": "小巷"
    }
    ]
}